using System;

namespace PlugInLibrary
{
    public class Quote
    {
        public void Run()
            => Console.WriteLine(@"""Мы называем трудным то, что не удается большинству людей. Если ты работал над чем-то, довел
дело до конца и продолжаешь поддерживать его на протяжении жизни – это достижение выделяет
тебя среди окружающих: тех, кто взялся за самое трудное и тех, кто продолжает решать сложные
задачи. Вы удивитесь, насколько интеллектуально ленивыми мы можем быть. Я могу пойти
по более простому пути обучения и получать «пятерки», а все будут в восторге от моих оценок. Оценки
должны показывать, насколько ты крут, но твоя так называемая «крутость» не измеряется
оценками, она измеряется твоими реальными достижениям. Вот почему самых выдающихся людей
не спрашивают об их дипломе. Звание не имеет никакого значения."" Нил Деграсс Тайсон");
    }
}
